app/views/twitter_names/show.html.erb

<h1><%=@data.first[1].first.username%></h1>
<h3>Here are <%=@data.first[1].first.tweets_collected%> of their tweets:</h3>
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."twitter_name_id" = 14129087