app/controllers/twitter_names_controller.rb

INSERT INTO "tweets" ("created_at", "domain", "text", "tweet_date", "twitter_name_id", "twitter_tweet_id", "updated_at", "url") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
INSERT INTO "twitter_names" ("created_at", "tweets_collected", "twitter_name_id", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Wed, 15 Jan 2014 19:23:40 UTC +00:00], ["tweets_collected", nil], ["twitter_name_id", nil], ["updated_at", Wed, 15 Jan 2014 19:23:40 UTC +00:00], ["username", nil]]
---
  def create
    #make a new twittername from the form
    @new_tname = TwitterName.new
    @new_tname.username = params[:username]
    @new_tname.tweets_collected = params[:tweets_collected]
    #make a temporary User so we have access to those class methods
    @curr_user = User.new() #probably should get current from sessions?
    #make a twitter client so I can lookup the twitter_user_id
    twitter_client = @curr_user.auth_twitter
    twitter_person = twitter_client.user(@new_tname.username)
    @new_tname.twitter_name_id = twitter_person.attrs[:id].to_s
    @new_tname.save

SELECT "twitter_names".* FROM "twitter_names"
---
  def index
    @twitternames = TwitterName.all

SELECT "twitter_names".* FROM "twitter_names" WHERE "twitter_names"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "tweets".* FROM "tweets" WHERE "tweets"."twitter_name_id" = 14129087 ORDER BY domain
SELECT "tweets".* FROM "tweets" WHERE "tweets"."twitter_name_id" = 14129087 LIMIT 1
---
  def show
    @username = TwitterName.find(params[:id])
    @tweets = Tweet.where(twitter_name_id: @username.twitter_name_id).order(:domain)
    @domain_counts = {}
    @tweets.each do |tweet|