app/controllers/twitter_names_controller.rb

UPDATE "tweets" SET "tweet_date" = '2014-01-03 01:41:20.000000', "twitter_name_id" = 14129087, "text" = '(@ American Airlines Center - @insideaacenter for Montreal Canadiens vs Dallas Stars w/ @jbloomgarden) [pic]: http://t.co/3vpmGyEsIn', "updated_at" = '2014-01-15 20:07:24.183322' WHERE "tweets"."id" = 4
---
  def create

    #Make a new twittername from the form
    tn = TwitterName.find_by_username(params[:username])

    #Make a temporary User so we have access to those class methods
    @current_user = User.new

    #Specify the TwitterName's attributes
    twitter_client = @current_user.auth_twitter
    if tn
      @curr_tname = tn
      @curr_tname.tweets_collected = params[:tweets_collected]
      @curr_tname.save